#+TITLE:Vika's Literate Emacs config
#+OPTIONS: H:4
#+PROPERTY: header-args:emacs-lisp :exports code :noweb yes :tangle ./init.el :comments yes
#+STARTUP: fold

This is the quest for the perfect Emacs config. It will never be fully
completed but it will eventually become better over time, which brings
me closer to the ultimate goal.

#+BEGIN_SRC emacs-lisp :comments no
;; -*- lexical-binding: t; -*-
;; Copyright (c) 2021 Vika Shleina
;;
;; Author: Vika Shleina <vika@fireburn.ru>
;;
;; This file is not part of GNU Emacs.
(message "Loading Vika's config for Emacs...")
#+END_SRC

*** Installing packages using Nix
Nix manages the =load-path= of Emacs using a wrapper, so we don't have to
do much. It even can install system packages which Emacs uses directly
inside of our =PATH=!

To detect if this config is built with Nix or not, we can rely on Nix
wrappers for Emacs setting load-path to paths within =/nix/store= with the
following function:

#+BEGIN_SRC emacs-lisp
(defun vika/built-by-nix-p ()
  "Detect if this Emacs was configured using Nix."
  (eval `(or . ,(mapcar
                 (lambda (path)
                   (not (eq nil (string-match "/nix/store/[a-z0-9]*-emacs-packages-deps/.*" path))))
                 load-path))))
#+END_SRC

This is probably one of the weirdest-looking functions I've ever
written, but it works surprisingly well. I'm not sure how well does it
scale though, since my =load-path= is relatively short:

#+BEGIN_SRC emacs-lisp :tangle no :exports both
(length load-path)
#+END_SRC

#+RESULTS:
: 91

